Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: །ཁ་ཅིག་དེ་བཞིན་གཤེགས་པ་མཆོད་སྒོ་དང་། །སྦྱིན་པ་བསམ་གྱིས་མི་ཁྱབ་གཏོང་སྒོ་དང་། །སྦྱངས་པའི་ཡོན་ཏན་ཚུལ་ཁྲིམས་ཀུན་སྒོ་དང་། །བཟོད་པ་མི་ཟད་མི་འཁྲུགས་སྒོ་དག་དང་། །
en: “ ‘Some train others by means of worshiping the tathāgatas, By means of making inconceivably great gifts, By means of purified qualities and complete moral conduct, And by means of inexhaustible, undisturbed patience.

source: ཁ་ཅིག་བརྟུལ་ཞུགས་དཀའ་ཐུབ་བརྩོན་སྒོ་དང་། །བསམ་གཏན་རབ་ཏུ་ཞི་བར་གནས་སྒོ་དང་། །དོན་ལ་རྣམ་ངེས་ཤེས་རབ་སྒོ་རྣམས་དང་། །སྤྱད་པ་ཀུན་ལྡན་ཐབས་ཀྱི་སྒོ་དག་དང་། །
en: “ ‘Some train others by means of striving in ascetic hardships of discipline, By means of remaining tranquilly in meditative concentration, By means of discriminating wisdom that discerns the meaning, And by means of the methods that embody all forms of conduct.

source: ཚངས་པའི་གནས་པ་དག་དང་མངོན་ཤེས་སྒོ། །བསྡུ་བའི་དངོས་པོས་ཕན་པར་འདོད་སྒོ་དང་། །བསོད་ནམས་བསགས་དང་ཡེ་ཤེས་སྒོ་དག་དང་། །བདེན་དང་བརྟེན་དང་རྣམ་པར་ཐར་སྒོ་དང་། །
en: “ ‘Some train others by means of the brahmic stages and clairvoyance, By means of desiring to benefit others through the four attracting things, By means of accumulating merit and gnosis, And by means of the truths, dependence, and the emancipations.

source: ཁ་ཅིག་སྟོབས་དང་དབང་པོ་ལམ་སྒོ་དང་། །ཉན་ཐོས་ཐེག་པས་རྣམ་པར་གྲོལ་སྒོ་དང་། །རྐྱེན་གྱི་ཐེག་པས་རྣམ་པར་དག་སྒོ་དང་། །ཐེག་པ་མཆོག་གི་རྣམ་པར་འཕྲུལ་སྒོ་དང་། །
en: “ ‘Some train others by means of the powers and the path of the faculties, By means of emancipation through the śrāvaka vehicle, By means of purification through the vehicle of conditions, And by means of the magical displays of the highest vehicle.

source: ཁ་ཅིག་མི་རྟག་ཉིད་དང་སྡུག་བསྔལ་སྒོ། །ཁ་ཅིག་བདག་མེད་སྲོག་མེད་སྒོ་དག་དང་། །མི་སྡུག་འདུ་ཤེས་འདོད་ཆགས་བྲལ་སྒོ་དང་། །ཞི་འགོག་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཡིས་འདུལ།
en: “ ‘Some train others by means of impermanence and suffering, Some by means of selflessness and the absence of a life spirit, By means of no desire through conceiving of the unpleasant, And by means of the absorption of peace and cessation.

source: །འགྲོ་བའི་སྤྱོད་པའི་སྒོ་རྣམས་ཇི་སྙེད་པ།
en: “ ‘However many avenues of behavior there are for sentient beings,

source: །དེ་སྙེད་ཆོས་ཀྱི་སྒོ་ལ་རབ་ཞུགས་ཏེ།
en: They will have entered that many avenues of the Dharma.

source: །དེ་དག་ཀུན་དུ་རྣམ་ཐར་སྒོ་དག་ནས། །བསམ་པ་ཇི་བཞིན་འཇིག་རྟེན་སེམས་ཅན་འདུལ།
en: Through the avenues of emancipation for all of them, Sentient beings of the world are trained in line with their thoughts.

source: །གང་དག་ཀུན་དུ་རྣམ་ཐར་སྒོ་དག་ནས། །བསམས་བཞིན་འཇིག་རྟེན་སེམས་ཅན་འདུལ་བྱེད་པ། །དེ་དག་སུས་ཀྱང་མཚན་མར་གཟུང་མི་ནུས།
en: “ ‘Those who thus train sentient beings of the world in line with their thoughts Through all these avenues of emancipation Cannot be apprehended by anyone in terms of phenomenal marks.

source: །ཏིང་འཛིན་རྣམ་པར་འཕྲུལ་བ་དེ་འདྲའོ།
en: Such are their magical displays of absorption.

source: །དེ་དག་དགའ་བ་བཀོད་པའི་ཏིང་འཛིན་མཆོག །འགྲོ་བ་ཐམས་ཅད་ཡོངས་སྨིན་འཐུན་བྱེད་པ། དགའ་བདེ་སྤྲོ་བ་རབ་དགའ་ཀུན་ལྡན་པས། །བསམས་པ་བརྟན་ནས་སེམས་ཅན་འདུལ་བར་བྱེད།
en: “ ‘They train sentient beings by stabilizing their minds Through the highest absorption joyful display, Which conforms with the maturing of all living beings, Having all the pleasure of happiness, joy, and delight.

source: །གང་དུ་ལོ་ཉེས་འཇིག་རྟེན་ཡོ་བྱད་གང་། །བདེ་བྱེད་ཐམས་ཅད་རབ་ཏུ་དཀོན་གྱུར་པ། །དེར་ནི་ཀུན་གྱིས་བསམས་བཞིན་བྱ་བ་ཡིན།
en: “ ‘Where crops fail in the world, and provisions And things that cause happiness become very scarce, There they act for all in line with their thoughts;

source: །སྦྱིན་པ་སྦྱིན་ཞིང་འགྲོ་བའི་དོན་རྣམས་བྱེད།
en: Giving gifts, they achieve the welfare of living beings.

source: །དེ་དག་ཟས་སྐོམ་མཆོག་དང་རོ་མཆོག་དང་། །གོས་དང་བགོ་བ་རིན་ཆེན་སྣ་ཚོགས་དང་། །རྒྱལ་སྲིད་ནོར་དང་བདག་ཕངས་ཡོངས་གཏོང་བས། །སྦྱིན་ལ་མོས་པའི་འགྲོ་བ་འདུལ་བར་བྱེད།
en: “ ‘By renouncing the best quality and best tasting food and drink, Fine garments and clothing, various valuables, The wealth of the kingdom, and selfish disappointments, They train those living beings who highly value generosity.

source: །བརྟན་པ་དེ་དག་མཚན་མཆོག་ལུས་སྤྲས་ཤིང་། །གོས་དང་རྒྱན་མཆོག་བགོས་ཤིང་བརྒྱན་བྱས་ཏེ། །ཕྲེང་བས་སྤུད་ཅིང་སྤོས་ཀྱིས་བསྐུས་པ་ཡི། །གཟུགས་རྣམས་བསྟན་པས་སེམས་ཅན་འདུལ་བར་བྱེད།
en: “ ‘Those firm ones train sentient beings by manifesting bodies Adorned with the highest signs, Ornamented by the best clothing and jewel ornaments,Adorned with flower garlands, and anointed with fragrance.

source: །མཐོང་ན་དགའ་ཚིམ་རབ་ཏུ་དགའ་རྣམས་ལ།
en: “ ‘To those who deeply enjoy what they see,

source: །བློ་མཆོག་དེ་དག་གཟུགས་མཆོག་གཟུགས་བཟང་བ། །གཟུགས་ཀྱི་དམ་པ་ཡོངས་སུ་སྟོན་བྱེད་ཅིང་།
en: Those most intelligent ones Manifest supreme bodies, excellent bodies, and the best of bodies,

source: །གཟུགས་ལ་མོས་པའི་སེམས་ཅན་འདུལ་བར་བྱེད།
en: And thus they train sentient beings who highly value bodies.

source: །དེ་དག་ཀ་ལ་པིང་ཀའི་སྒྲ་སྙན་དང་། །ཁུ་བྱུག་ཀུན་ལ་དང་པའི་སྒྲ་སྐད་དང་། །རྔ་དང་ཚངས་དང་མིའམ་ཅི་ཡི་སྒྲས། །མོས་པ་ཀུན་ལ་དེ་བཞིན་ཆོས་ཀྱང་སྟོན།
en: “ ‘They accordingly teach Dharma according to all inclinations, Such as teaching by means of the sweet call of a kalaviṅka bird, Or teaching a cuckoo bird through the call of a swan, Or by means of a drum, or the voice of Brahmā, or the voice of a kinnara.

source: །སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་གང་ཡིན་པས། །རྒྱལ་བ་གང་དག་འགྲོ་བའི་དོན་མཛད་པའི། །ཆོས་ཀྱི་བྱེ་བྲག་སྒོ་མོ་དེ་དག་གིས། །བསམ་པ་ཇི་བཞིན་འཇིག་རྟེན་སེམས་ཅན་འདུལ།
en: “ ‘They train the sentient beings of the world according to each one’s inclination By means of different kinds of Dharma, Namely, by means of the eighty-four thousand articles of Dharma That were taught by the victors for the welfare of living beings.

source: །དེ་དག་བདེ་དང་སྡུག་བསྔལ་གྲོགས་ཀྱང་བྱེད།
en: “ ‘They even make happiness the friend of suffering,

source: །དོན་དང་གནོད་པའི་གྲོགས་ཀྱང་དེ་བཞིན་བྱེད།
en: And they make their own aim the friend of harmfulness.

source: །བྱ་བ་ཀུན་ལ་གྲོགས་སུ་འགྱུར་བྱས་ཤིང་།
en: By thus making friends in all activities,

source: །གྲོགས་ཀྱི་སྒོ་ནས་སེམས་ཅན་འདུལ་བར་བྱེད།
en: They train sentient beings by means of friends.

source: །སྡུག་བསྔལ་གནོད་པ་འདུས་བྱས་སྐྱོན་གྱི་རྣམས། །གྲོགས་ཀྱི་དོན་དུ་དེ་དག་བཟོད་བྱེད་ཅིང་།
en: “ ‘They tolerate, for the sake of friends, Suffering, harm, and the faults of conditioned things,

source: །འགྲོ་བ་ཀུན་ལ་ཕན་དོན་བདེ་དོན་དུ།
en: And for the welfare and happiness of all living beings

source: །དེ་དག་གྲོགས་དོན་གནོད་པ་དང་དུ་ལེན།
en: They undertake harm for the sake of friends.

source: །གང་ན་མངོན་བྱུང་མེད་ཅིང་ཆོས་མེད་དེ། །དགོན་པར་འགྲོ་དང་ཐར་པ་མི་དམིགས་པ།
en: “ ‘In places where there is no going forth, no Dharma, And no going into solitude or realizing emancipation,

source: །དེར་ནི་རྒྱལ་སྲིད་འབྱོར་བ་རབ་སྤངས་ཏེ།
en: They give up the wealth of their kingdoms

source: །ཞི་བའི་ཡིད་ཀྱིས་གནས་མེད་མངོན་པར་འབྱུང་།
en: And, with peaceful minds, go forth without any fixed abode.

source: །དེ་དག་ཁྱིམ་དང་འཆིང་དང་སྲིད་པའི་གནས། །འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་དགྲོལ་བའི་ཕྱིར།
en: “ ‘In order to free all living beings From the states of home, bondage, and existence,

source: །འདོད་པའི་དགའ་བ་ཀུན་ལ་མི་གནས་པར། །མངོན་པར་བྱུང་ཞིང་ཐར་པ་རབ་ཏུ་བརྗོད།
en: They will live in renunciation, clearly teaching emancipation, Without remaining stuck in any desired pleasure.

source: །དེ་དག་སྤྱོད་པ་བཅུ་རྣམས་རྗོད་བྱེད་ཅིང་། །སྐྱེས་ཆེན་རྣམས་ཀྱི་ཆོས་སྤྱོད་གང་ཡིན་དང་། །དྲང་སྲོང་རྣམས་ཀྱི་སྤྱོད་ཀུན་མ་ལུས་པར། ཡོངས་སུ་བརྗོད་ཅིང་འགྲོ་བའི་དོན་རྣམས་བྱེད།
en: “ ‘They explain the ten conducts And work for the welfare of living beings By teaching in detail the Dharma practices of sublime beings And all the practices of seers.

source: །གང་ན་སེམས་ཅན་དཔག་མེད་ཚེ་ལྡན་ཞིང་། །བདེ་དང་ལྡན་ལ་ཉོན་མོངས་ཆུང་ཡོད་པ། །དེར་ནི་རྒ་བས་ཉེན་ཅིང་ནད་བུ་ཅན། །བདག་ལ་དབང་མེད་འཆི་བའི་དབང་གྱུར་སྟོན།
en: “ ‘In realms where sentient beings possess infinite lives And live happily with few defilements, They will manifest their own uncontrollable deaths, Afflicted by old age and illness.

source: །འདོད་ཆགས་འབར་ཞིང་ཞེ་སྡང་རབ་འབར་ལ། །འཇིག་རྟེན་གཏི་མུག་མེ་ཆེན་རབ་འབར་ཞིང་། །རྒ་དང་ན་དང་འཆི་བ་རབ་འབར་བའི། །འཇིག་རྟེན་བསྟན་ནས་སེམས་ཅན་འདུལ་བར་བྱེད།
en: “ ‘They will train sentient beings by manifesting worlds In which desire burns, anger burns, And ignorance blazes, And in which old age, sickness, and death all blaze.

source: །དེ་དག་སངས་རྒྱས་སྟོབས་བཅུ་བརྩོན་བཞི་དང་།
en: “ ‘By means of the ten powers of the Buddha, the four diligences,

source: །ཆོས་ཀྱི་ཁྱད་པར་བཅྭ་བརྒྱད་རྣམས་ཀྱིས་ཀྱང་།
en: And the eighteen special qualities,

source: །སངས་རྒྱས་ཆེ་བའི་བདག་ཉིད་རྗོད་བྱེད་ཅིང་།
en: They express the great nature of the Buddha

source: །སངས་རྒྱས་ཡོན་ཏན་རྣམས་ཀྱིས་འགྲོ་དོན་བྱེད།
en: And achieve the welfare of beings through the qualities of a buddha.

source: །དེ་དག་ཀུན་བརྗོད་རྫུ་འཕྲུལ་རྗེས་བསྟན་པས།
en: “ ‘By issuing proclamations via magical displays

source: །གཟུགས་ཀྱི་བྱིན་རླབས་སྟོབས་ཀྱིས་ཐམས་ཅད་དུ།
en: Through the power of the blessing of forms,

source: །དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་སྟོན་བྱེད་ཅིང་།
en: They demonstrate everywhere the wonders of the Tathāgata

source: །རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པས་སེམས་ཅན་འདུལ།
en: And train sentient beings through the wonders of magical displays.

source: །དེ་དག་ཐབས་ཚུལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས།
en: “ ‘Through a wide variety of methods,

source: །འཇིག་རྟེན་རྒྱུ་ཞིང་འགྲོ་བའི་དོན་རྣམས་བྱེད།
en: They wander the world and work for the welfare of living creatures.

source: །འཇིག་རྟེན་མི་ཆགས་ཆུ་ལ་པད་མ་བཞིན།
en: Unattached to the world like lotus flowers in water,

source: །དགའ་ཞིང་དད་པར་བྱེད་ལ་རྣམ་པར་རྒྱུ།
en: They wander, gladdening and inspiring those they meet.

source: །དེ་དག་སྙན་དངགས་མཁན་རྒྱལ་སྙན་དངགས་སྦྱོར།
en: “ ‘As poets, they compose poems of the victors;

source: །གར་མཁན་རྔ་མཁན་གྱད་དང་རོལ་མོ་མཁན།
en: They are dancers, drummers, strongmen, and musicians;

source: །བཞག་མཛེས་རྒྱན་ཕྲེང་ཐོགས་ཤིང་གར་བྱེད་དང་།
en: They bear lassos that are garlands of beautiful ornaments and they dance,

source: །སྒྱུ་མ་མཁན་པོ་གཟུགས་མང་ཀུན་དུ་སྟོན།
en: And they manifest the many bodily forms of a magician.

source: །གྲོང་པ་གྲོང་དཔོན་ཁ་ལོ་སྒྱུར་བར་འགྱུར།
en: “ ‘As town dwellers they will rule as headmen.

source: །དེ་བཞིན་དེད་དཔོན་ཚོང་དཔོན་ཁྱིམ་བདག་འགྱུར།
en: Similarly, they will become caravan leaders, traders, or householders.

source: །རྒྱལ་པོ་བློན་པོ་མདུན་འདོན་ཕོ་ཉ་དང་།
en: They will also become kings, minsters, courtiers, messengers,

source: །སྨན་པ་འཇིག་རྟེན་བསྟན་བཅོས་ཆོ་ག་མཁན།
en: Or doctors and knowers of worldly sciences.

source: །དེ་དག་དགོན་པར་ལྗོན་ཤིང་ཆེན་པོར་འགྱུར། །སྨན་དང་རིན་ཆེན་མི་ཟད་གཏེར་རྣམས་དང་། །ཡིད་བཞིན་ནོར་བུ་འདོད་འབྱིན་སྡོང་པོ་དང་།
en: “ ‘In remote places, they will become great wish-granting trees That grant medicines, inexhaustible treasures, And wish-granting jewels,

source: །ལམ་གོལ་དོང་བ་རྣམས་ལ་ལམ་སྟོན་འགྱུར།
en: And they will show the correct path to those who are lost while traveling.

source: །འཇིག་རྟེན་བྱུང་ནས་མི་རིང་ཤེས་གྱུར་ཅིང་།
en: “ ‘Having appeared in the world, they learn quickly,

source: །སེམས་ཅན་ལས་ཀྱི་ཚུལ་རྣམས་མི་ཤེས་པ།
en: And they will explain the world to all those sentient beings Who do not know the ways of work

source: །དེ་དག་ཀུན་ལ་རྨོས་ཆོས་ཚོང་ཐབས་དང་། །སྣ་ཚོགས་བཟོ་རྣམས་འཇིག་རྟེན་རྗོད་པར་བྱེད།
en: Such as agriculture, commerce, and the various arts and crafts.

source: །འཚེ་མེད་གནོད་པ་མེད་པའི་སྦྱོར་བ་གང་།
en: “ ‘Any engagements that are nonviolent and harmless

source: །སེམས་ཅན་བདེ་བྱེད་མཁས་པས་རབ་བསྔགས་པ།
en: And that make beings happy are praised by the wise.

source: །རིགས་སྟོབས་སྨན་དང་བསྟན་བཅོས་སྣ་ཚོགས་ཀུན།
en: The powers of reasoning, medicine, and all the various treatises

source: །དྲང་སྲོང་དེ་དག་རྣམས་ཀྱིས་རབ་ཏུ་བརྗོད།
en: Are described in detail by these seers.

source: །གང་ལ་ལྷར་བཅས་འཇིག་རྟེན་མོས་འགྱུར་བ། །དྲང་སྲོང་སྤྱོད་མཆོག་དམ་པ་གང་ཡིན་དང་། །བརྟུལ་ཞུགས་དཀའ་སྤྱད་དཀའ་ཐུབ་མཆོག་ཀུན་ཀྱང་།
en: “ ‘Those most expert ones describe in detail The highest conduct of seers, Which is admired by the whole world along with the gods,

source: མཁས་པ་དེ་དག་རྣམས་ཀྱིས་རབ་ཏུ་བརྗོད།
en: And all the supreme austerities among the ascetic disciplines.

source: །དེ་དག་སྤྱོད་ཅན་ཀུན་རྒྱུ་མུ་སྟེགས་ཅན། །གདུང་བ་གཽ་ཏ་མ་དང་མི་སྨྲར་སྤྱོད། །གཅེར་བུ་གོས་མེད་ལྷུར་ལེན་དགེ་སྦྱོང་ལ། །མུ་སྟེགས་ཅན་གྱི་སློབ་དཔོན་མཁས་པར་སྟོན།
en: “ ‘They manifest themselves as expert teachers of the tīrthikas, Of the carakas and parivrājakas, The ascetics, gautamas, those observing silence, And naked, ascetic śramaṇas who practice wearing no clothing.

source: །དེ་དག་ཀུན་དུ་འཚོ་བའི་ཆོས་འཛིན་དང་། །བླ་ན་ཡོད་དང་བླ་ན་མེད་རྣམས་དང་། །རལ་པ་རིང་དང་གཞོན་ནུའི་བརྟུལ་ཞུགས་ཅན། །དེ་དག་ཏུ་ཡང་སློབ་དཔོན་འགྱུར་བ་ཡིན།
en: “ ‘They become teachers of those who adhere to the Ājīvaka creed, Of those for whom there is surpassing and those for whom there is no surpassing, Of those with long matted hair, And of those vowed to ascetic discipline from youth.

source: །ཉི་མའི་རྗེས་ལྟ་དཀའ་ཐུབ་ལྔ་ལྡན་དང་།།ཁྱི་དང་བ་ལང་བརྟུལ་ཞུགས་རི་དགས་སྤྱོད། །གླེའུ་ཅན་དག་དང་མུ་སྟེགས་སུམ་ཅུ་པ། དེ་དག་ཏུ་ཡང་དེ་དག་སློབ་དཔོན་འགྱུར།
en: “ ‘They also become teachers to those who practice Gazing at the sun or in the fivefold austerity, Of those who follow the behavior of dogs and oxen, of those who live like deer, And of the thirty kinds of tīrthika adepts.

source: །ལྷ་ཡི་ཤེས་ལ་འཇུག་པ་དགའ་རྣམས་དང་།
en: “ ‘To those who delight in engaging in their knowledge of gods

source: །མུ་སྟེགས་ཉེ་རེག་ཡུལ་དུ་རྒྱུ་རྣམས་སུ།
en: And who wander in sacred tīrtha ablution places,

source: །རྩ་བ་འབྲས་བུ་ཆུ་སྤྱོད་གྱུར་ནས་ཀྱང་།
en: After partaking of roots, fruits, and water

source: །བསམ་ཡས་ཆོས་ལ་དེ་དག་དམ་པ་མཆོག
en: The supreme worthy ones teach the inconceivable Dharma.

source: །ཙོག་པུར་འདུག་དང་གཅིག་པུ་རྒྱུ་བ་དང་། །ཚེར་མ་རྩྭ་དང་ཐལ་བར་ཉལ་བ་དང་། །གང་དག་གཏུན་ཤིང་མལ་ཅན་གནས་པ་དང་། །དེ་དག་ཏུ་ཡང་དེ་དག་སློབ་དཔོན་འགྱུར།
en: “ ‘They also become teachers to those who practice Staying in small tents, solitary wanderers Who sleep on thorny grass and in the dust, And those who live lying on beds of pounding sticks.

source: །ཕྱི་རོལ་མུ་སྟེགས་ཅན་རྣམས་ཇི་སྙེད་པ། །དེ་དག་བསམ་པ་མོས་པ་རྟོགས་བྱས་ཤིང་།
en: “ ‘They strive to understand the motivation and inclinations Of all the outsider tīrthikas there are, no matter how numerous,

source: །བསྙེན་དཀའ་མི་བཟད་དྲག་ཤུལ་དཀའ་ཐུབ་ཀྱིས།
en: And use the unbearable difficulty of achieving those harsh austerities

source: །མུ་སྟེགས་ཅན་གྱི་སྡུག་བསྔལ་སྤང་བར་འདུལ།
en: To train those tīrthikas to abandon their misery.

source: །འཇིག་རྟེན་ལྟ་བས་འཁྲུགས་པ་ཤེས་བྱས་ནས།
en: “ ‘Having understood the agitation caused in the world by views,

source: །ལྟ་བ་ངན་ལ་གནས་པའི་མུ་སྟེགས་ཅན། །ཀུན་ལ་ཕྲ་བའི་གཞི་དང་ཐབས་ཚུལ་གྱིས། །དེ་དག་རྣམས་ལ་བདེན་པ་སྟོན་པར་བྱེད།
en: To all those tīrthikas who harbor bad views They teach the truth Using the method of subtle words.

source: །ལ་ལར་འགྲོ་ལྡིང་བ་ཡི་སྔགས་ཀྱི་གཞི།
en: “ ‘For some they use the mantra words of Dramiḍa

source: །ཤིན་ཏུ་གསང་བའི་གཞི་ཡིས་བདེན་པ་སྟོན།
en: Or highly secret words to teach the truth.

source: །ལ་ལ་དག་ལ་གསལ་ཞིང་དྲང་ཚིག་གིས།
en: For some they use direct words that are clear,

source: །ལ་ལ་དག་ལ་ལྷ་ཡི་གསང་ཚིག་གིས།
en: And for some the mysterious words of the gods.

source: །ལ་ལ་དག་ལ་ཡི་གེ་དབྱེ་ཚིག་དང་། །དོན་ལ་རྣམ་ངེས་རྡོ་རྗེའི་ཚིག་རྣམས་དང་། །རྒོལ་བ་འདུལ་བ་ཤེས་བའི་ཚིག་རྣམས་དང་། །བསྟན་བཅོས་ཐུབ་མེད་ཐར་བའི་ཚིག་རྣམས་ཀྱིས།
en: “ ‘For some they teach using words with distinct syllables, For some with vajra words that define the meaning, For some with knowledge words that subdue antagonists, And for some with the liberating words of the unassailable treatises.

source: །ལ་ལ་དག་ལ་མི་སྐད་ཚིག་རྣམས་དང་།
en: “ ‘Some they teach using mantra words from human languages,

source: །ཀུན་ལ་འཇུག་པའི་ཚིག་ངེས་ཚིག་རྣམས་ཀྱིས།
en: Or using words for interpreting universally understood language;

source: །ལ་ལ་དག་ལ་ལྷ་ཚིག་ངེས་ཚིག་དང་། །ཀླུ་ཡི་ངེས་ཚིག་གནོད་སྦྱིན་ངེས་ཚིག་གིས།
en: Some they teach using words for interpreting the language of gods, And some using words for interpreting nāgas and words for interpreting yakṣas.

source: །ལ་ལར་སྲིན་པོ་འབྱུང་པོ་ཤ་ཟ་དང་། །དྲི་ཟ་གྲུལ་བུམ་ལྟོ་འཕྱེ་ཆེ་ཚིག་དང་། །མི་ཅི་ལྷ་མིན་མཁའ་ལྡིང་ཚིག་རྣམས་ཀྱིས།
en: “ ‘And for some, using the words of rākṣasa, bhūta, and piśāca evil spirits, And gandharvas, kumbhāṇḍas, and mahoragas, And the words of kinnaras, asuras, and garuḍas,

source: །བདེན་པ་བསྟན་ཅིང་ཐར་བར་འདྲེན་པར་བྱེད། །
en: They reveal the truth and lead them to liberation.

source: དེ་དག་བདེན་དང་ངེས་ཚིག་ཚུལ་ཤེས་ཏེ། །དེ་ལྟར་རྒྱལ་བའི་ཆོས་རྣམས་མ་ལུས་པའི། །ཆོས་ཉིད་བསམ་ཡས་ཚིག་ལམ་ཤེས་པས་སྟོན།
en: “ ‘Knowing truth and how to use words that interpret, they teach, Through knowing the path of speech, the inconceivable ultimate nature Of all the Dharma teachings of the Victor, without exception.

source: །དེ་དག་ཏིང་འཛིན་རྣམ་འཕྲུལ་དེ་འདྲའོ།། །།
en: Their magical display of meditative absorptions is like this.

source: དེ་དག་འགྲོ་བདེ་མཆོག་གི་ཏིང་ངེ་འཛིན། །འགྲོ་བ་ཀུན་ལ་མངོན་བར་སྒྲུབ་བྱེད་ཅིང་།
en: “ ‘As they accomplish with regard to all beings The absorption of beings’ highest bliss,

source: །འོད་ཟེར་བསམ་གྱིས་མི་ཁྱབ་རབ་བཀྱེ་སྟེ།
en: They emanate inconceivable light rays,

source: །འོད་ཟེར་བཀྱེ་ནས་སེམས་ཅན་འདུལ་བར་བྱེད།
en: And emanating light rays, they train sentient beings.

source: །མཐོང་ན་ལེགས་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They radiate light rays that are beautiful to behold.

source: །སེམས་ཅན་ཇི་སྙེད་འོད་ཟེར་དེ་ཤེས་པ།
en: However many sentient beings may perceive such light rays,

source: །དེ་དག་མཐོང་ལེགས་དོན་མེད་མ་ཡིན་ཏེ།
en: They are beautiful to behold and not fruitless

source: །བླ་ན་མེད་པའི་ཡེ་ཤེས་མཆོག་གི་རྒྱུ།
en: Because they are the cause of supreme insuperable gnosis.

source: །མི་རྣམས་ཀུན་ལ་སངས་རྒྱས་ཡོངས་བསྟན་ཅིང་།
en: “ ‘Displaying the buddhas to all humans,

source: །ཆོས་ཀྱང་ཡོངས་བསྟན་དེ་ལམ་བསྟན་ཅིང་།
en: Displaying the Dharma as well and not displaying it,

source: །རྒྱལ་བའི་སྐུ་གཟུགས་མཆོད་རྟེན་བསྟན་བྱས་པས།
en: And displaying for their worship the images of the Victors,

source: །དེས་ན་མཐོང་ལེགས་འོད་ཟེར་གྲུབ་པར་འགྱུར།
en: Light rays beautiful to behold will thus be perfected.

source: །ལྷ་ཡི་འོད་ཟེར་ཟིལ་གྱིས་གནོན་པ་ཡི། །འོད་ཟེར་འོད་བྱེད་ཅེས་བྱ་རབ་གཏོང་ཞིང་།
en: “ ‘Sending forth what are called illuminating light rays That eclipse even the light rays of the gods,

source: །རྡུལ་དང་མུན་པ་ཐམས་ཅད་བསལ་བྱས་ཏེ།
en: Illuminating all particles and darkness,

source: །འཇིག་རྟེན་ཕན་པའི་འོད་དེས་རབ་ཏུ་སྣང་།
en: These lights that bring benefit to the world illuminate everything.

source: །སེམས་ཅན་གང་དག་འོད་དེས་བསྐུལ་བྱས་པ།
en: “ ‘Those sentient beings inspired by that light

source: །དེ་དག་རྒྱལ་བ་མཆོད་ཕྱིར་སྒྲོན་མ་འཛིན།
en: All hold lamps for the sake of worshiping the Victor.

source: །དེ་དག་རྒྱལ་བ་མཆོད་ཕྱིར་སྒྲོན་བཟུང་བས།
en: Because they hold lamps for the sake of worshiping the Victor,

source: །འཇིག་རྟེན་སྒྲོན་མ་མཛད་པའི་རྒྱལ་བར་འགྱུར།
en: They will become victors who are lights of the world.

source: །འབྲུ་མར་མར་མེ་མར་གྱི་མར་མེ་དང་། །རྩྭ་ཤིང་འདམ་བུ་འོད་མའི་སྒྲོན་མ་དང་། །སྤོས་དང་བཅུད་ལེན་རིན་ཆེན་སྒྲོན་མ་དག །རྒྱལ་བ་རྣམས་ལ་ཕུལ་ནས་འོད་བྱེད་ཐོབ།
en: “ ‘Offering to the victors lamps that burn mustard seed oil and that burn butter, And torches of grass, wood, reeds, or bamboo, And precious lanterns of fragrance and elixir, They thus attain the status of illuminators.

source: །སྒྲོལ་ཞེས་བྱ་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays called liberators,

source: །དེ་དག་སྲེད་ཡངས་སྲིད་པའི་རྒྱ་མཚོ་ལས། །སེམས་ཅན་བསྒྲལ་བའི་དོན་དུ་གོ་ཆ་གྱོན།
en: Gird themselves with armor for the sake of liberating sentient beings From the ocean of existence with its extensive craving.

source: །གང་དག་སྲེད་ཡངས་སྲིད་པའི་རྒྱ་མཚོ་ལས། །སེམས་ཅན་བསྒྲལ་བའི་དོན་དུ་གོ་གྱོན་པ།
en: “ ‘Those who gird themselves with armor for the sake of liberating sentient beings From the ocean of existence with its extensive craving

source: །དེ་དག་ཆུ་བོ་བཞི་ལས་རབ་ཏུ་སྒྲོལ།
en: Will free beings from the four rivers.

source: །མྱ་ངན་མེད་པ་བདེ་བའི་གྲོང་ཁྱེར་སྟོན།
en: They are shown the city of the bliss of nirvāṇa.

source: །སྟེགས་དང་ཟམ་པ་དུ་མ་བྱས་པ་དང་། །ཆུ་ཀླུང་ལམ་ལ་སྒྲོལ་བའི་གྲུ་འབྱིན་ཏེ།
en: “ ‘Having made numerous ford landings and bridges, They provide boats to rescue those on river routes.

source: །འདུས་བྱས་སུན་ཕྱུང་ཞི་བ་བསྔགས་བྱས་པས།
en: By praising the peace of eradicating conditioned things,

source: །དེས་ན་སྒྲོལ་བའི་འོད་ཟེར་གྲུབ་པར་འགྱུར།
en: They thus achieve liberating light rays.

source: །སྐོམ་པ་སེལ་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays that quench thirst,

source: །འདོད་པའི་ཡོན་ཏན་སྐོམ་པ་རབ་སྤངས་ཤིང་།
en: Shun thirst for the sense objects

source: །ཆོས་ལ་མོས་པའི་རོ་ནི་དོན་ཏུ་གཉེར།
en: And strive to acquire a taste for savoring the Dharma.

source: །འདོད་པའི་ཡོན་ཏན་སྐོམ་པ་རབ་སྤངས་ཏེ།
en: “ ‘By shunning thirst for sense objects

source: །ཆོས་མོས་རོ་ལ་དོན་དུ་གཉེར་གྱུར་པས།
en: And striving to attain a taste for savoring the Dharma,

source: །བདུད་རྩི་ཆར་པ་འབེབས་པའི་སངས་རྒྱས་འགྱུར།
en: They will become buddhas who shower down rains of nectar of immortality.

source: །འཇིག་རྟེན་སྐོམ་པའི་སྲེད་པ་རྣམ་པར་སེལ།
en: Thus they will quench the craving of the thirst of the world.

source: །རྫིང་དང་ཆུ་ཀླུང་ཁྲོན་པ་ཆུ་དོང་དང་། །མཚོ་རྣམས་བྱང་ཆུབ་དོན་དུ་བྱེད་བཙུད་དེ།
en: “ ‘Ponds, rivers, wells, river banks, and lakes Are turned into things that advance the attainment of awakening,

source: །འདོད་པ་སྨད་ཅིང་བསམ་གཏན་བསྔགས་བྱས་པས།
en: And by disparaging lust while praising meditative concentration,

source: །དེས་ན་སྲེད་པ་སེལ་བ་གྲུབ་པར་གྱུར།
en: They will achieve the quenching of craving.

source: །དགའ་བར་བྱེད་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate gladdening light rays,

source: །དགའ་བ་རྒྱས་ཤིང་བྱང་ཆུབ་མཆོག་དོན་དུ། །རང་བྱུང་འགྱུར་བར་བྱ་ཞེས་སེམས་བསྐྱེད་དོ།
en: Will feel very glad and will conceive the thought: “I will become a self-arisen one for the sake of supreme awakening!”

source: །ཐུགས་རྗེ་ལྡན་པའི་སྐུ་གཟུགས་མཚན་བརྒྱན་པ།
en: “ ‘By causing the compassionate one’s body, which is ornamented by marks,

source: །པད་མའི་གདན་ལ་བཞུགས་པ་རྣམས་བྱས་ཤིང་།
en: To sit upon a lotus seat,

source: །རྟག་ཏུ་སངས་རྒྱས་ཡོན་ཏན་རྣམས་བརྗོད་པས།
en: And by always praising the qualities of the Buddha,

source: །དེས་ན་དགའ་བྱེད་འོད་ཟེར་གྲུབ་པར་གྱུར།
en: They achieve gladdening light rays.

source: །མགུ་བར་བྱེད་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘Emanating pleasing light rays,

source: །རྟག་ཏུ་སངས་རྒྱས་ལ་ནི་དགའ་མགུ་ཞིང་།
en: Will always please the Buddha,

source: །ཆོས་ལ་དགའ་མགུ་དགེ་འདུན་དགའ་མགུའོ།
en: Always please the Dharma, and always please the Saṅgha.

source: །དེ་དག་རྟག་ཏུ་སངས་རྒྱས་དགའ་མགུ་ཞིང་།
en: “ ‘After always pleasing the Buddha,

source: །ཆོས་ལ་དགའ་མགུ་དགེ་འདུན་དགའ་མགུ་ནས།
en: Always pleasing the Dharma, and always pleasing the Saṅgha,

source: །སངས་རྒྱས་ཆོས་དང་འཕགས་པའི་ཚོགས་རྣམས་དང་། །རྟག་ཏུ་འགྲོགས་ཐོབ་བཟོད་པ་བླ་མེད་ཐོབ།
en: They attain the Buddha, Dharma, and assembly of the exalted, Perpetually gain friends, and attain insuperable patience.

source: །སངས་རྒྱས་རྗེས་དྲན་ཆོས་དང་ཚོགས་མཆོག་ལ། །སེམས་ཅན་མང་པོ་བསྐུལ་ཅིང་དྲན་བྱས་ཏེ།
en: “ ‘With an awareness of the Buddha and encouraging many sentient beings To worship the Dharma and highest assembly,

source: །བྱང་ཆུབ་སེམས་ཀྱི་ཡོན་ཏན་རབ་བརྗོད་པས།
en: Through expressing the qualities of the thought of awakening

source: །དེས་ན་མགུ་བྱེད་འོད་ཟེར་གྲུབ་པར་འགྱུར།
en: They will therefore achieve pleasing light rays.

source: །བསོད་ནམས་བསགས་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays of gathering merit,

source: །བླ་ན་མེད་པའི་བྱང་ཆུབ་དོན་གཉེར་ཞིང་།
en: Will strive to attain the highest awakening

source: །སྦྱིན་པ་སྣ་ཚོགས་དུ་མ་སྦྱིན་པར་བྱེད།
en: And will give manifold and numerous gifts.

source: །གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་དེ་བྱེད་ཚེ།
en: “ ‘When giving gifts without limitation,

source: །སློང་བ་རྣམས་ཀྱི་བསམ་པ་རྫོགས་བྱས་ཏེ།
en: They satisfy the wishes of the recipients,

source: །བསམ་པ་ཐམས་ཅད་སྦྱིན་པ་བྱིན་བྱས་པས།
en: And through granting the gift of all their wishes,

source: །བསོད་ནམས་བསགས་པའི་འོད་ཟེར་གྲུབ་པར་འགྱུར།
en: They achieve light rays of gathering merit.

source: །ཡེ་ཤེས་ལྡན་པའི་འོད་ཟེར་རབ་གཏོང་ཞིང་།
en: “ ‘They emanate light rays endowed with gnosis,
